package com.example.java_.operatorPrecedence.t2;

public class Run {
	public static void main(String[] args) {

		int i = 0;

//		if () {
//
//		}

//		System.out.println(i++ == 1);






	/*
		1	++	후위 증가 연산자
		 	--	후위 감소 연산자
		 	()	함수 호출
		 	[]	첨자 연산자
		 	.	참조에 의한 선택
		 	->	포인터를 통한 선택
		2	!	논리 NOT 연산자
		 	~	비트 NOT 연산자
		 	+	양의 부호 (단항 연산자)
		 	-	음의 부호 (단항 연산자)
		 	++	전위 증가 연산자
		 	--	전위 감소 연산자
		 	(타입)	타입 캐스트 연산자
		 	*	참조 연산자 (단항 연산자)
		 	&	주소 연산자 (단항 연산자)
		 	sizeof	크기
		3	*	곱셈 연산자
		 	/	나눗셈 연산자
		 	%	나머지 연산자
		4	+	덧셈 연산자 (이항 연산자)
		 	-	뺄셈 연산자 (이항 연산자)
		5	<<	비트 왼쪽 시프트 연산자
		 	>>	부호 비트를 확장하면서 비트 오른쪽 시프트
		6	<	관계 연산자(보다 작은)
		 	<=	관계 연산자(보다 작거나 같은)
		 	>	관계 연산자(보다 큰)
		 	>=	관계 연산자(보다 크거나 같은)
		7	==	관계 연산자(와 같은)
		 	!=	관계 연산자(와 같지 않은)
		8	&	비트 AND 연산자
		9	^	비트 XOR 연산자
		10	|	비트 OR 연산자
		11	&&	논리 AND 연산자
		12	||	논리 OR 연산자
		13	? :	삼항 조건 연산자
		14	=
		대입 연산자 및 복합 대입 연산자

		(=, +=, -=, *=, /=, %=, <<=, >>=, &=, ^=, |=)

		15	,	쉼표 연산자

	*/

	}
}
